app/controllers/topics_controller.rb

	def create
		respond_to do |format|
			if topic.save
---
INSERT INTO "topics" ("topic", "user_id", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["topic", "11"], ["user_id", 1], ["content", "1"], ["created_at", 2016-12-03 11:59:57 UTC], ["updated_at", 2016-12-03 11:59:57 UTC]]

	def destroy
		topic.destroy
---
DELETE FROM "topics" WHERE "topics"."id" = $1  [["id", 3]]