app/controllers/users_controller.rb

	def update
		respond_to do |format|
			if user.update_attributes(user_params)
---
UPDATE "users" SET "nickname" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["nickname", "JPKuba"], ["updated_at", 2016-12-04 12:38:12 UTC], ["id", 1]]